# SphericalLightDistribution Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SphericalLightDistribution Constructor
SphericalLightDistribution Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SphericalLightDistribution()()()() | Creates a spherical light distribution object. |
| SphericalLightDistribution(SphericalLightDistribution) | Creates a copy of the given spherical light distribution |

# See Also
SphericalLightDistribution Class
SphericalLightDistribution Members
Autodesk.Revit.DB.Lighting Namespace